IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_dcsm_z2_otp_regs.xml
<module id="DCSM_Z2_OTP" HW_revision="" description="DCSM Z2 OTP Registers">
	<register id="Z2OTP_LINKPOINTER1" width="32" page="1" offset="0x0" internal="0" description="Zone 2 Link Pointer1">
		<bitfield id="Z2OTP_LINKPOINTER1" description="Zone2 Link Pointer 1 location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_LINKPOINTER2" width="32" page="1" offset="0x2" internal="0" description="Zone 2 Link Pointer2">
		<bitfield id="Z2OTP_LINKPOINTER2" description="Zone2 Link Pointer 2 location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_LINKPOINTER3" width="32" page="1" offset="0x4" internal="0" description="Zone 2 Link Pointer3">
		<bitfield id="Z2OTP_LINKPOINTER3" description="Zone2 Link Pointer 3 location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_GPREG1" width="32" page="1" offset="0x8" internal="0" description="Zone 2 General Purpose Register 1">
		<bitfield id="Z2OTP_GPREG1" description="Zone2 General Purpose register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_GPREG2" width="32" page="1" offset="0xa" internal="0" description="Zone 2 General Purpose Register 2">
		<bitfield id="Z2OTP_GPREG2" description="Zone2 General Purpose register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_GPREG3" width="32" page="1" offset="0xc" internal="0" description="Zone 2 General Purpose Register 3">
		<bitfield id="Z2OTP_GPREG3" description="Zone2 General Purpose register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_GPREG4" width="32" page="1" offset="0xe" internal="0" description="Zone 2 General Purpose Register 4">
		<bitfield id="Z2OTP_GPREG4" description="Zone2 General Purpose register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_PSWDLOCK" width="32" page="1" offset="0x10" internal="0" description="Secure Password Lock">
		<bitfield id="Z2OTP_PSWDLOCK" description="Zone2 Password lock location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2OTP_CRCLOCK" width="32" page="1" offset="0x12" internal="0" description="Secure CRC Lock">
		<bitfield id="Z2OTP_CRCLOCK" description="Zone2 CRC lock location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
